English/NCE2/L16 A polite request.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org0dd083e" class="outline-2">
<h2 id="org0dd083e">Lesson 16 A polite request</h2>
<div class="outline-text-2" id="text-org0dd083e">
<p class="verse">
What was the polite request?<br />
<br />
If you <b>park your car</b> in the wrong place, a traffic policeman will soon find it.<br />
You will be very lucky if he lets you go without a ticket.<br />
However, this does not always happen.<br />
Traffic police are sometimes very polite.<br />
During a holiday in Sweden, I found this note on my car:<br />
&#xa0;'Sir, we welcome you to our city.<br />
This is a "No Parking" area.<br />
You will enjoy your stay here if you <b>pay atention to</b> our street signs.<br />
This note is only a reminder.'<br />
If you receive a request like this, you cannot <b>fail to obey</b> it!<br />
</p>
</div>
<div id="outline-container-org1357475" class="outline-3">
<h3 id="org1357475">expression</h3>
<div class="outline-text-3" id="text-org1357475">
<p>
park [pɑːk] v.停放(汽车)<br />
traffic [ˈtræfɪk] n.交通<br />
ticket [ˈtɪkɪt] n.交通违规罚款单<br />
note [nəʊt] n.便条<br />
area [ˈeəriə] n.地段<br />
sign [saɪn] n.指示牌<br />
reminder [rɪˈmaɪndə(r)] n.提示<br />
fail [feɪl] v.无视,忘记<br />
obey [əˈbeɪ] v.服从<br />
</p>

<p>
make notes/ a note 做笔记<br />
leave a note 留下便条<br />
remind sb. of sth./sb. 使得某人想起某事或某人<br />
fail to do sth. 失败做某事<br />
</p>

<hr />
<p>
if从句<br />
</p>
<ul class="org-ul">
<li>主将从现<br /></li>
<li>主情从现<br /></li>
<li>主祈从现<br /></li>
</ul>

<p>
park sb's car 停某人的车<br />
pay attention to 注意到某事<br />
</p>
</div>
</div>


<div id="outline-container-orge8123d4" class="outline-3">
<h3 id="orge8123d4">单词造句</h3>
<div class="outline-text-3" id="text-orge8123d4">
<p>
park<br />
</p>
<ul class="org-ul">
<li>Sir, you can't park your car here.<br /></li>
<li>Why can't I park it here?<br /></li>
<li>Is there a parking lot near here, sir?<br /></li>
<li>Look, we're not allowed to park here.<br /></li>
<li>I had an amusing experience while I was parking my car.<br /></li>
</ul>
<p>
traffic<br />
</p>
<ul class="org-ul">
<li>Damn, a traffic jam.<br /></li>
<li>Our son is a traffic police and we're very proud of him.<br /></li>
<li>Those traffic lights have been broken by three kids last night.<br /></li>
<li>If there is a heavy traffic, we will be late.<br /></li>
<li>Pay atention to those traffic lights.<br /></li>
</ul>
<p>
ticket<br />
</p>
<ul class="org-ul">
<li>If you park there, you will get a traffic ticket for that.<br /></li>
<li>A traffic police waved to me and asked me to stop, then he gave me a ticket.<br /></li>
<li>Zhangwei cannot afford to pay so many traffic tickets.<br /></li>
<li>I can't afford to pay an air ticket to Beijing.<br /></li>
<li>Now, you can pay for my ticket.<br /></li>
</ul>
<p>
note<br />
</p>
<ul class="org-ul">
<li>I believe that you will make notes in my class.<br /></li>
<li>He asks me to leave a note.<br /></li>
<li>He refused to lend me his notes.<br /></li>
<li>I borrowed his notes from him.<br /></li>
<li>To my surprise, he has made notes last night.<br /></li>
</ul>
<p>
area<br />
</p>
<ul class="org-ul">
<li>This is a "No Parking" area.<br /></li>
<li>Is this a "No Parking" area?<br /></li>
<li>Why is this a "No Parking" area?<br /></li>
<li>Don't park in a "No Parking" area?<br /></li>
<li>Why do you park your car in a "No Parking" area?<br /></li>
</ul>
<p>
sign<br />
</p>
<ul class="org-ul">
<li>Can you read that sign?<br /></li>
<li>Look at that sign.<br /></li>
<li>Pay attention to these street's signs.<br /></li>
<li>The signs have been damaged by these kids.<br /></li>
<li>We can't afford to pay so many signs.<br /></li>
</ul>
<p>
reminder<br />
</p>
<ul class="org-ul">
<li>This is only a reminder.<br /></li>
<li>It reminds me of my father.<br /></li>
<li>Why does it reminds you of your father?<br /></li>
<li>What reminds you of your father?<br /></li>
<li>The alarm clock reminds me of doing my homework.<br /></li>
</ul>
<p>
fail<br />
</p>
<ul class="org-ul">
<li>He always fail to pay it back on time.<br /></li>
<li>I can't fail to do my homework.<br /></li>
<li>He fails to borrow the chess from his neighbor.<br /></li>
<li>He failed to get a telephone for his garage.<br /></li>
<li>He failed to write a single postcard.<br /></li>
</ul>
<p>
obey<br />
</p>
<ul class="org-ul">
<li>We must obey the traffic rules.<br /></li>
<li>I refused to obey that stupid rules.<br /></li>
<li>Why did you refuse to obey that rules?<br /></li>
<li>I can't fail to obey a police request.<br /></li>
<li>Please obey his request.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgb976aa9" class="outline-3">
<h3 id="orgb976aa9">反复听电影片段</h3>
</div>
<div id="outline-container-org4aa1e0b" class="outline-3">
<h3 id="org4aa1e0b">Pattern Drill 写+读</h3>
<div class="outline-text-3" id="text-org4aa1e0b">
<ul class="org-ul">
<li>1<br />
<ul class="org-ul">
<li>miss the train - go by taxi<br />
You'll miss the train if you're not careful.<br />
If I do, I'll go by taxi.<br /></li>
<li>break that vase - buy a new one<br />
You'll break that vase if you're not careful.<br />
If I do, I'll buy a new one.<br /></li>
<li>catch a cold - stay in bed<br />
You'll catch a cold if you're not careful.<br />
If I do, I'll stay in bed.<br /></li>
<li>fail your test - try again<br />
You'll fail your test, if you're not careful.<br />
If I do, I'll try again.<br /></li>
<li>lose your job - find an other<br />
You'll lose your job if you're not careful.<br />
If I do, I'll find an other.<br /></li>
</ul></li>
<li>2<br />
<ul class="org-ul">
<li>clean the car<br />
Shall I clean the car for you?<br />
You can clean it if you want to.<br /></li>
<li>post these parcels<br />
Shall I post these parcels for you?<br />
You can post them if you want to.<br /></li>
<li>pay the bill<br />
Shall I pay the bill for you?<br />
You can pay it if you want to.<br /></li>
<li>order the books<br />
Shall I order the books for you?<br />
You can order them if you want to.<br /></li>
<li>take you to the theater<br />
Shall I take you to the theater for you?<br />
You can take me if you want to.<br /></li>
</ul></li>
<li>3<br />
<ul class="org-ul">
<li>sell it<br />
What'll you do if he doesn't sell it?<br />
I'm sure he will sell it, but if he doesn't, I'll sell it myself.<br /></li>
<li>write the letter<br />
What'll you do if he doesn't write the letter?<br />
I'm sure he will write it, but if he doesn't, I'll write it myself.<br /></li>
<li>return the books<br />
What'll you do if he doesn't return the books?<br />
I'm sure he will return them, but if he doesn't, I'll return them myself.<br /></li>
<li>repair the gate<br />
What'll you do if he doesn't repair the gate?<br />
I'm sure he will repair it, but if he doesn't, I'll repair it myself.<br /></li>
<li>ring the police<br />
What'll you do if he doesn't ring the police?<br />
I'm sure he will ring them, but if he doesn't, I'll ring them myself.<br /></li>
</ul></li>
<li>4<br />
<ul class="org-ul">
<li>speak to him - nervous<br />
Don't speak to him if he's nervous.<br />
Of course I shan't speak to him if he's nervous.<br /></li>
<li>disturb him - working<br />
Don't disturb him if he's working.<br />
Of course I shan't disturb him if he's working.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc09016d" class="outline-3">
<h3 id="orgc09016d">给自己讲解</h3>
</div>
<div id="outline-container-orgf4e8c75" class="outline-3">
<h3 id="orgf4e8c75">红皮书</h3>
</div>
<div id="outline-container-org8b4695c" class="outline-3">
<h3 id="org8b4695c">习惯用法造句</h3>
<div class="outline-text-3" id="text-org8b4695c">
<p>
park sb's car<br />
</p>
<ul class="org-ul">
<li>She parked her car in front of the theater last night.<br /></li>
<li>Did she park her car in front of the theater last night?<br /></li>
<li>Why didn't she park her car in front of theater last night?<br /></li>
<li>Where did she park her car last night?<br /></li>
<li>When did she park her car in front of the theater?<br /></li>
</ul>
<p>
pay attention to<br />
</p>
<ul class="org-ul">
<li>You must pay attention to this video.<br /></li>
<li>Must I pay attention to this video?<br /></li>
<li>Why must I pay attention to this video?<br /></li>
<li>What will I get if I pay attention to this video?<br /></li>
<li>I'll give you an extra 1000 pounds a year if you pay attention to your work every day.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3721078" class="outline-3">
<h3 id="org3721078">跟读至背诵</h3>
</div>
<div id="outline-container-org7ec088c" class="outline-3">
<h3 id="org7ec088c">Ask me if 写+读</h3>
<div class="outline-text-3" id="text-org7ec088c">
<ol class="org-ol">
<li>Traffic police give parking tickets.<br />
What do traffic police do?<br />
Who give parking tickets?<br /></li>
<li>They will soon find your car, if you park in the wrong place.<br />
How quickly will they find your car, if you park in the wrong place?<br /></li>
<li>Traffic police are sometimes very polite.<br />
Who are sometimes very polite?<br /></li>
<li>I went to Sweden for a holiday.<br />
Where did I go for a holiday?<br /></li>
<li>I found a note on my car.<br />
What did you find on your car?<br />
Where did you find a note?<br /></li>
<li>It said, "Welcome to our city".<br />
What did it say?<br /></li>
<li>My car was in a "No Parking" area.<br />
Where was my car?<br />
What was in a "No Parking" area?<br />
Whose car was in a "No Parking" area?<br /></li>
<li>You'll enjoy your stay here.<br />
What will you enjoy?<br /></li>
<li>The note was only a reminded.<br />
What was the note?<br /></li>
<li>I obeyed the request.<br />
What did I do?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgac28f27" class="outline-3">
<h3 id="orgac28f27">摘要写作</h3>
<div class="outline-text-3" id="text-orgac28f27">
<p>
Traffic police usually give you a ticket if you park my car in the wrong place.<br />
But the writer found a polite note on his car during a holiday in Sweden.<br />
The traffic police wanted him to pay attention to street's signs.<br />
Everyone cannot fail to obey a request like this.<br />
</p>
</div>
</div>
<div id="outline-container-orgcddf108" class="outline-3">
<h3 id="orgcddf108">tell the story 口语</h3>
</div>
<div id="outline-container-org290b70c" class="outline-3">
<h3 id="org290b70c">Topics for discussion</h3>
<div class="outline-text-3" id="text-org290b70c">
<p>
What will happen if you park a car in the place in your city?<br />
Is it useful to have a car in a city? Why/Why not?<br />
Do you think the Swedish traffic police are always so polite? Why/Why not?<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
